In [4]:
import pandas as pd
from sqlalchemy import create_engine
from functools import reduce
from pyecharts import options as opts
from pyecharts.charts import Line,Bar,Pie

#链接mysql
def mysqlDB(sql):
    engine = create_engine(
        'mysql+pymysql://schu:slavep@123.103.75.152:3306/school')
    result = pd.read_sql_query(sql = sql, con = engine)
    return result

In [5]:
lxc_sql = '''
SELECT fr.school_id,fr.name,os.name as belong_name ,g.grade_name ,s.subject_name,t.teacher_name ,count( DISTINCT tt.task_id ) as lxc_count
            from tp_task_info  tt, franchised_school_info fr ,as_answer_sheet_info aa ,oracle2utf.school_info os ,subject_info s,grade_info g,teacher_info t
            where    fr.school_id not in ( 50043,51613,50041,53741,50068,53535,50044,100002368)  and fr.SCHOOL_ID = aa.dc_school_id  and s.subject_id = aa.subject_id and g.grade_id = aa.grade_id
            and tt.task_value_id = aa.paper_id  and aa.workbook_paper = 1 and os.school_id = fr.belong_school_id and aa.c_time >'2021-7-15'  and t.user_id = tt.c_user_id  and tt.CLASSROOM_ID is null
            GROUP BY fr.school_id,aa.grade_id ,aa.SUBJECT_ID,tt.c_user_id
                        '''
lxc_school = mysqlDB(lxc_sql)
lxc_school_list = tuple(set(lxc_school['school_id'].tolist()))
print(lxc_school_list)

(53120, 100002311, 51992, 100001432, 100000925, 51875, 53542, 100001194, 100002348, 100002102, 52792, 100001209, 51899, 53950, 100002119, 100002121, 52811, 52685, 100002127, 51282, 53209, 100001243, 100000604, 51429, 100002021, 51303, 100002407, 100002286, 53104, 53880, 53883, 52860)

In [6]:
dtk_sql = '''
SELECT fr.school_id,fr.name,os.name as belong_name ,g.grade_name ,s.subject_name,t.teacher_name ,count( DISTINCT tt.task_id ) as dtk_count
            from tp_task_info  tt, franchised_school_info fr ,as_answer_sheet_info aa ,oracle2utf.school_info os ,subject_info s,grade_info g,teacher_info t
            where    fr.school_id  in {} and fr.SCHOOL_ID = aa.dc_school_id  and s.subject_id = aa.subject_id and g.grade_id = aa.grade_id
            and tt.task_value_id = aa.paper_id  and aa.workbook_paper = 0 and os.school_id = fr.belong_school_id and aa.c_time >'2021-7-15'  and t.user_id = tt.c_user_id  and tt.CLASSROOM_ID is null
            GROUP BY fr.school_id,aa.grade_id ,aa.SUBJECT_ID,tt.c_user_id
'''.format(lxc_school_list)

df =[mysqlDB(dtk_sql),lxc_school]
school_task_count = reduce(lambda left, right: pd.merge(left, right, on=['school_id','name','belong_name','grade_name','subject_name','teacher_name'], how='left'), df)
school_task_count

,school_id,name,belong_name,grade_name,subject_name,teacher_name,dtk_count,lxc_count
0,51282,海南省海口市第九中学,海南海口分校,初二年级,政治,陈丽梅,1,NaN
1,51303,山东省烟台十四中,山东烟台五四分校,高二年级,英语,王娴燕,55,NaN
2,51303,山东省烟台十四中,山东烟台五四分校,高二年级,英语,闫婷婷,63,NaN
3,51303,山东省烟台十四中,山东烟台五四分校,高二年级,物理,王彦梅,1,NaN
4,51303,山东省烟台十四中,山东烟台五四分校,初三年级,语文,初中杨昌群,1,NaN
...,...,...,...,...,...,...,...,...
740,100002407,青岛凤台中学,山东青岛分校,初一年级,历史,孙丽,11,NaN
741,100002407,青岛凤台中学,山东青岛分校,初一年级,生物,孙丽,1,NaN
742,100002407,青岛凤台中学,山东青岛分校,初一年级,生物,张虎,1,NaN
743,100002407,青岛凤台中学,山东青岛分校,初一年级,生物,王新凤,4,NaN
744,100002407,青岛凤台中学,山东青岛分校,初一年级,政治,王增正,2,NaN